cfd/c172/openfoam/case/system/blockMeshDict_bak_1_block
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cv_x_min -20.0;
cv_x_max  60.0;
cv_y_min -15.0;
cv_y_max  15.0;
cv_z_min -15.0;
cv_z_max  15.0;

convertToMeters 1.0;

vertices
(
      ( $cv_x_min $cv_y_min $cv_z_min )
      ( $cv_x_max $cv_y_min $cv_z_min )
      ( $cv_x_max $cv_y_max $cv_z_min )
      ( $cv_x_min $cv_y_max $cv_z_min )
      ( $cv_x_min $cv_y_min $cv_z_max )
      ( $cv_x_max $cv_y_min $cv_z_max )
      ( $cv_x_max $cv_y_max $cv_z_max )
      ( $cv_x_min $cv_y_max $cv_z_max )
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 ) ( 80 30 30 ) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 4 7 3 )
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            ( 1 2 6 5 )
        );
    }
    
    walls
    {
        type patch;
        faces
        (
            ( 0 1 5 4 ) // left
            ( 3 7 6 2 ) // right
            ( 0 3 2 1 ) // bottom
            ( 4 5 6 7 ) // top
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
