cfd/c172/openfoam/case/system/blockMeshDict_bak_3_blocks
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cv_x_min -20.0;
cv_x_max  60.0;
cv_y_min -15.0;
cv_y_max  15.0;
cv_z_min -15.0;
cv_z_max  15.0;

s2_x_min  -5.0;
s2_x_max  15.0;

convertToMeters 1.0;

vertices
(
      ( $cv_x_min $cv_y_min $cv_z_min )
      ( $s2_x_min $cv_y_min $cv_z_min )
      ( $s2_x_min $cv_y_max $cv_z_min )
      ( $cv_x_min $cv_y_max $cv_z_min )
      ( $cv_x_min $cv_y_min $cv_z_max )
      ( $s2_x_min $cv_y_min $cv_z_max )
      ( $s2_x_min $cv_y_max $cv_z_max )
      ( $cv_x_min $cv_y_max $cv_z_max )
      ( $s2_x_max $cv_y_min $cv_z_min )
      ( $s2_x_max $cv_y_max $cv_z_min )
      ( $s2_x_max $cv_y_min $cv_z_max )
      ( $s2_x_max $cv_y_max $cv_z_max )
      ( $cv_x_max $cv_y_min $cv_z_min )
      ( $cv_x_max $cv_y_max $cv_z_min )
      ( $cv_x_max $cv_y_min $cv_z_max )
      ( $cv_x_max $cv_y_max $cv_z_max )
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7 ) ( 15 30 30 ) simpleGrading ( 0.5 1.0 1.0 )
    hex ( 1  8  9  2  5 10 11  6 ) ( 30 30 30 ) simpleGrading ( 1.0 1.0 1.0 )
    hex ( 8 12 13  9 10 14 15 11 ) ( 45 30 30 ) simpleGrading ( 2.0 1.0 1.0 )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 4 7 3 )
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            ( 12 13 15 14 )
        );
    }
    
    walls
    {
        type patch;
        faces
        (
            // left
            (  0  1  5  4 )
            (  1  8 10  5 )
            (  8 12 14 10 )
            
            // right
            (  3  7  6  2 )
            (  2  6 11  9 )
            (  9 11 15 13 )
            
            // bottom
            (  0  3  2  1 )
            (  1  2  9  8 )
            (  8  9 13 12 )
            
            // top
            (  4  5  6  7 )
            (  5 10 11  6 )
            ( 10 14 15 11 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
